## code to prepare `marketbasket` dataset goes here

library(dplyr)

ratingdata_reference <- tribble(
  ~customer, ~item, ~rating,
  "고객 1", "상품 1", 5,
  "고객 1", "상품 3", 4,
  "고객 1", "상품 5", 1,
  "고객 1", "상품 6", 0,
  "고객 1", "상품 7", 3,
  "고객 2", "상품 1", 4,
  "고객 2", "상품 2", 4,
  "고객 2", "상품 3", 4,
  "고객 2", "상품 7", 1,
  "고객 3", "상품 1", 5,
  "고객 3", "상품 2", 4,
  "고객 3", "상품 4", 1,
  "고객 3", "상품 5", 2,
  "고객 3", "상품 7", 3,
  "고객 4", "상품 1", 1,
  "고객 4", "상품 2", 2,
  "고객 4", "상품 3", 1,
  "고객 4", "상품 4", 4,
  "고객 4", "상품 5", 3,
  "고객 4", "상품 6", 5,
  "고객 4", "상품 7", 2,
  "고객 5", "상품 1", 0,
  "고객 5", "상품 2", 1,
  "고객 5", "상품 4", 3,
  "고객 5", "상품 5", 5,
  "고객 5", "상품 6", 5,
  "고객 6", "상품 2", 2,
  "고객 6", "상품 5", 4,
  "고객 6", "상품 6", 4,
  "고객 6", "상품 7", 2
)

ratingdata_target <- tribble(
  ~customer, ~item, ~rating,
  "목표고객", "상품 1", 5,
  "목표고객", "상품 4", 1,
  "목표고객", "상품 7", 2
)


purchasedata_reference <- tribble(
  ~customer, ~item, ~purchase,
  "고객 1", "상품 1", 1,
  "고객 1", "상품 3", 1,
  "고객 1", "상품 5", 1,
  "고객 1", "상품 7", 1,
  "고객 2", "상품 1", 1,
  "고객 2", "상품 2", 1,
  "고객 2", "상품 3", 1,
  "고객 2", "상품 7", 1,
  "고객 3", "상품 1", 1,
  "고객 3", "상품 2", 1,
  "고객 3", "상품 4", 1,
  "고객 3", "상품 5", 1,
  "고객 3", "상품 7", 1,
  "고객 4", "상품 1", 1,
  "고객 4", "상품 2", 1,
  "고객 4", "상품 3", 1,
  "고객 4", "상품 4", 1,
  "고객 4", "상품 6", 1,
  "고객 4", "상품 7", 1,
  "고객 5", "상품 2", 1,
  "고객 5", "상품 4", 1,
  "고객 5", "상품 5", 1,
  "고객 5", "상품 6", 1,
  "고객 6", "상품 2", 1,
  "고객 6", "상품 5", 1,
  "고객 6", "상품 6", 1,
  "고객 6", "상품 7", 1
)

purchasedata_target <- tribble(
  ~customer, ~item, ~purchase,
  "목표고객", "상품 1", 1,
  "목표고객", "상품 4", 1,
  "목표고객", "상품 7", 1
)


usethis::use_data(
  ratingdata_reference,
  ratingdata_target,
  purchasedata_reference,
  purchasedata_target,
  overwrite = TRUE
)
